In [1]:
import numpy as np
np.__version__

'1.14.2'

In [2]:
import pandas as pd ## Pandas is very fast
pd.__version__

'0.22.0'

## Data frames

In [95]:
 ## one-dimensional array of indexed data
 ## a specialization of a Python dictionary   
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [9]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [11]:
data.values[0] ## same as data[0]

0.25

In [13]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [20]:
## can be accessed via index nmaenb mi 19*/
data['a']

0.25

Pandas Series makes it much more efficient than Python dictionaries for certain operations. Pandas used type-specific similar to numpy vs list speed up.

In [21]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [22]:
population['California']

38332521

In [25]:
print(population[0])
print(population.index)

38332521
Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [27]:
pd.Series({2:'a', 1:'b', 3:'c'}) ## data can be a dictionary

1    b
2    a
3    c
dtype: object

In [28]:
# series is populated only with the explicitly identified keys.
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

In [29]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [89]:
list(area.items())

[('California', 423967),
 ('Florida', 170312),
 ('Illinois', 149995),
 ('New York', 141297),
 ('Texas', 695662)]

In [36]:
goat_dict=pd.Series({'NBA':"Kobe Bryant", 'NFL':"Tom Brady",'Variety Show':'Running Man'})

In [37]:
goat_dict

NBA             Kobe Bryant
NFL               Tom Brady
Variety Show    Running Man
dtype: object

In [38]:
## pd dataframes is just a sequence of series
states = pd.DataFrame({'population': population,
                       'area': area})
print(states)

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [41]:
print(states.index)
print(states.columns)

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')
Index(['area', 'population'], dtype='object')

In [40]:
states.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [83]:
states.keys() ## colnames in dataframe with at least 2 columns
## In dataframe with 1 column or series, it's the rownames

Index(['area', 'population'], dtype='object')

In [90]:
list(states.items())

[('area', California    423967
  Florida       170312
  Illinois      149995
  New York      141297
  Texas         695662
  Name: area, dtype: int64), ('population', California    38332521
  Florida       19552860
  Illinois      12882135
  New York      19651127
  Texas         26448193
  Name: population, dtype: int64)]

In [43]:
print(states['area'])
print(states['population'])

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: population, dtype: int64

In [49]:
# single column df from a series
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193

In [51]:
data = [{'a': i, 'b': 2 * i} for i in range(3)] ##
##pd.DataFrame({'a':np.arange(3),'b':np.arange(3) * 2})
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [55]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [107]:
pd.DataFrame([{'a': 1, 'b': 2,'b': 3, 'c': 4}]) ## different than above

   a  b  c
0  1  3  4

In [63]:
## Panda index: immutable array or as an ordered set 
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [67]:
#immutable array, cannot change it
ind[1] = 0

TypeError: Index does not support mutable operations

In [65]:
## Indexing works like numpy array
print(ind[1])
print(ind[::2])
print(ind.size)

3
Int64Index([2, 5, 11], dtype='int64')
5

In [68]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [69]:
# intersection
indA & indB ## same as indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

In [70]:
# Union
indA | indB ## same as indA.union(indB)

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [71]:
# complement of (A & B) 
indA ^ indB ## indA.symmetric_difference(indB)

Int64Index([1, 2, 9, 11], dtype='int64')

## Indexing

In [112]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [98]:
'a' in data

True

In [99]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [100]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [101]:
## Series objects can even be modified with a dictionary-like syntax
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [104]:
data['a':'c'] ## same as data[0:3]

a    0.25
b    0.50
c    0.75
dtype: float64

In [105]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [106]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

### Explicit(`loc`) and implicit (`iloc`) indexing

In [115]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [118]:
# explicit index when indexing
data[3] ## 1,3,5 works, see counter example below

'b'

In [ ]:
## Recall that 
data2 = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data2[0]

In [133]:
# implicit index when slicing
print(data[1]) ## data.loc[1]
print('\n')
print(data[1:3]) ## this works similarily as above
## These are confusing therefore use loc and iloc for these

a


3    b
5    c
dtype: object

In [135]:
## explicit
data.loc[1:5]

1    a
3    b
5    c
dtype: object

In [136]:
data.loc[3]

'b'

In [132]:
## implicit
data.iloc[1]

'b'

In [138]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [139]:
data['area'] is data.area ## same thing bro as long as `area` is not a function

True

In [140]:
data['pop'] is data.pop ## therefore data['pop'] is recommended

False

In [141]:
data.pop ## is acutally a function

<bound method NDFrame.pop of               area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193>

In [146]:
data['density'] = data['pop'] / data['area']
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01]])

In [147]:
data.T

           California       Florida      Illinois      New York         Texas
area     4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05  6.956620e+05
pop      3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  2.644819e+07
density  9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02  3.801874e+01

In [156]:
data.values[0] ## work like numpy array

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [161]:
data.iloc[3:5,0:2] ## implicit

            area       pop
New York  141297  19651127
Texas     695662  26448193

In [160]:
data.loc['Florida':,:'pop'] ## explicit

            area       pop
Florida   170312  19552860
Illinois  149995  12882135
New York  141297  19651127
Texas     695662  26448193

The `ix` indexer allows a hybrid of these two approaches, however, it is subject to the same potential sources of confusion if series is indeded by integers

In [162]:
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [167]:
data.ix[:3,:'pop']

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [168]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [169]:
data.ix[data.density > 100, ['pop', 'density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [170]:
data.loc[data['density'] > 100, ['pop', 'density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [182]:
data.loc[data.iloc[:,2] > 100, ['pop', 'density'] ] ##data.iloc won't work here

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [188]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [189]:
data.loc['California', 'density'] = 89
data

              area       pop     density
California  423967  38332521   89.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

#### Directly indexing on df referes to slicing (row indexing)

In [193]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [249]:
data[1:3]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [251]:
data[0:1] ## works but not data[0]

              area       pop  density
California  423967  38332521     89.0

In [195]:
data[data.density > 100]

            area       pop     density
Florida   170312  19552860  114.806121
New York  141297  19651127  139.076746

### Operating on panda data frames

In [205]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [207]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [206]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [208]:
np.exp(df)

             A            B           C            D
0   403.428793  8103.083928    7.389056   403.428793
1  1096.633158    54.598150   20.085537  1096.633158
2  1096.633158     7.389056  148.413159    54.598150

In [213]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [214]:
population / area ## union was taken `area.index | population.index`

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [215]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B ## or A.add(B) similar as above, union is takend and index are matched explicitely

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [216]:
## replace NaN with values
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [217]:
list('AB')

['A', 'B']

In [218]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [219]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [220]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [222]:
A.add(B,fill_value=0)

      A     B    C
0   1.0  15.0  9.0
1  13.0   6.0  0.0
2   2.0   9.0  6.0

In [232]:
A.add(B,fill_value=np.mean(A.values))
# same as `A.add(B, fill_value=A.stack().mean())`

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [236]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

In [243]:
df.iloc[0] # same as df.iloc[0,:]

Q    3
R    8
S    2
T    4
Name: 0, dtype: int32

In [253]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [269]:
np.squeeze(np.array(df[0:1]))

array([3, 8, 2, 4])

In [270]:
df - np.squeeze(np.array(df[0:1])) ##works

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [257]:
df- df.values[0] ## works as well

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [280]:
df.subtract(df['R'], axis=0) ## same as (df.T-df['R']).T

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [301]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int32

In [302]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

### Missing values
Pandas chose to use sentinels for missing data and further chose to use two already-existing Python null values: the special floating-point `NaN` value, and the Python `None` object

In [303]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

Operating on object is slow and alos aggregations like `sum` and `min` with `None` will return error: `vals1.sum()` will not work

In [305]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [307]:
print(1 + np.nan)
print(0 * np.nan)
vals2.sum()

nan
nan

nan

In [308]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2) ## ignoring NaN

(8.0, 1.0, 4.0)

`NaN` and `None` both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate:

In [309]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [310]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [311]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [323]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [313]:
data.isnull() ## data.isna()

0    False
1     True
2    False
3     True
dtype: bool

In [316]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [320]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [321]:
data.dropna()

0        1
2    hello
dtype: object

In [322]:
data.fillna(8888)

0        1
1     8888
2    hello
3     8888
dtype: object

In [324]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df.dropna() ## same as df.dropna(axis='rows'), only row without any NaN remains

     0    1  2
1  2.0  3.0  5

In [325]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [333]:
df['3'] = np.nan ## adding another column
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [334]:
df.dropna(axis='columns', how='all') ### only drop if all elements is na (column)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [337]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [339]:
df.dropna(axis='rows', thresh=3) ## have at least 3 values

##similar to roll call data dropping, threshold would be missing more than 40% votes

     0    1  2   3
1  2.0  3.0  5 NaN

In [340]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [342]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [341]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [344]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [343]:
data.fillna(np.mean(data))

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [345]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [346]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [347]:
df.fillna(method='bfill', axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [3]:
## index is constructed as tuples
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [349]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [353]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [7]:
pop[[i for i in pop.index if i[0] == 'Texas']] ## indexing needs []

(Texas, 2000)    20851820
(Texas, 2010)    25145561
dtype: int64

In [44]:
for i in pop.index:
    print(i)

('California', 2000)
('California', 2010)
('New York', 2000)
('New York', 2010)
('Texas', 2000)
('Texas', 2010)

## Better method than above

In [360]:
index = pd.MultiIndex.from_tuples(index)
index
## first set of label for State, second for year

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [361]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### Important

In [396]:
## this indexing is according to index levels above [state,year]
## after above reindexing, works just like `np.array`
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [366]:
pop['Texas', 2010]

25145561

In [395]:
pop.loc['California':'New York']

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [394]:
pop[pop > 22000000]

California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

### convert multi indexed `series` to `DataFrame`

In [369]:
pop_df = pop.unstack() 
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [370]:
pop_df.stack() ## will convert it back to multi indexed series

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [371]:
## succinct way to represent data.
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [374]:
f_u18 = pop_df['under18'] / pop_df['total'] ## gives multi indexed series
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [376]:
 f_u18.unstack() ## convert it to df

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [378]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  36.8  53.0  37.8  32.0  37.5
     2      32.0  36.5  39.0  35.1  20.0  36.4
2014 1      27.0  37.3  28.0  35.6  52.0  36.8
     2      38.0  35.6  32.0  37.1  25.0  37.4

In [446]:
index_temp = pd.MultiIndex.from_tuples([(2013,1),(2013,2),(2014,1),
                                        (2014,2)],names=['year', 'visit'])
### more redundant way (previous method)
health_data2 = pd.DataFrame(data, index=index_temp, columns=columns)
health_data2

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  36.8  53.0  37.8  32.0  37.5
     2      32.0  36.5  39.0  35.1  20.0  36.4
2014 1      27.0  37.3  28.0  35.6  52.0  36.8
     2      38.0  35.6  32.0  37.1  25.0  37.4

In [392]:
health_data.loc[2013] ## health_data.loc[2013.:]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        35.0  36.8  53.0  37.8  32.0  37.5
2        32.0  36.5  39.0  35.1  20.0  36.4

In [387]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      53.0  37.8
     2      39.0  35.1
2014 1      28.0  35.6
     2      32.0  37.1

In [382]:
health_data.stack()

subject           Bob  Guido   Sue
year visit type
2013 1     HR    35.0   53.0  32.0
           Temp  36.8   37.8  37.5
     2     HR    32.0   39.0  20.0
           Temp  36.5   35.1  36.4
2014 1     HR    27.0   28.0  52.0
           Temp  37.3   35.6  36.8
     2     HR    38.0   32.0  25.0
           Temp  35.6   37.1  37.4

In [383]:
health_data.stack().stack()

year  visit  type  subject
2013  1      HR    Bob        35.0
                   Guido      53.0
                   Sue        32.0
             Temp  Bob        36.8
                   Guido      37.8
                   Sue        37.5
      2      HR    Bob        32.0
                   Guido      39.0
                   Sue        20.0
             Temp  Bob        36.5
                   Guido      35.1
                   Sue        36.4
2014  1      HR    Bob        27.0
                   Guido      28.0
                   Sue        52.0
             Temp  Bob        37.3
                   Guido      35.6
                   Sue        36.8
      2      HR    Bob        38.0
                   Guido      32.0
                   Sue        25.0
             Temp  Bob        35.6
                   Guido      37.1
                   Sue        37.4
dtype: float64

In [397]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  36.8  53.0  37.8  32.0  37.5
     2      32.0  36.5  39.0  35.1  20.0  36.4
2014 1      27.0  37.3  28.0  35.6  52.0  36.8
     2      38.0  35.6  32.0  37.1  25.0  37.4

In [435]:
health_data['Guido', 'HR'] ### default column index

year  visit
2013  1        53.0
      2        39.0
2014  1        28.0
      2        32.0
Name: (Guido, HR), dtype: float64

In [407]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      35.0  36.8
     2      32.0  36.5

In [415]:
health_data.loc[2013,'Bob']

type     HR  Temp
visit
1      35.0  36.8
2      32.0  36.5

#### Important

In [421]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        35.0
      2        32.0
2014  1        27.0
      2        38.0
Name: (Bob, HR), dtype: float64

In [420]:
health_data.loc[2013,['Bob','Guido']]

subject   Bob       Guido
type       HR  Temp    HR  Temp
visit
1        35.0  36.8  53.0  37.8
2        32.0  36.5  39.0  35.1

#### important

In [440]:
idx = pd.IndexSlice

In [441]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  36.8  53.0  37.8  32.0  37.5
     2      32.0  36.5  39.0  35.1  20.0  36.4
2014 1      27.0  37.3  28.0  35.6  52.0  36.8
     2      38.0  35.6  32.0  37.1  25.0  37.4

In [443]:
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      35.0  53.0  32.0
2014 1      27.0  28.0  52.0

In [444]:
health_data.loc[idx[2013, 1], idx['Bob', 'HR']] ### idx gives

35.0

### Many of the `MultiIndex` slicing operations will fail if the index is not sorted.

In [447]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]],names = ['char', 'int'])
data = pd.Series(np.random.rand(6), index=index)
data

char  int
a     1      0.074551
      2      0.986887
c     1      0.772245
      2      0.198716
b     1      0.005522
      2      0.815461
dtype: float64

In [457]:
data['a':'b'] ## without the c component, needs to sort the index first

char  int
a     1      0.074551
      2      0.986887
b     1      0.005522
      2      0.815461
dtype: float64

In [454]:
data = data.sort_index()
data ###

char  int
a     1      0.074551
      2      0.986887
b     1      0.005522
      2      0.815461
c     1      0.772245
      2      0.198716
dtype: float64

In [469]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [467]:
pop.unstack(level=0)

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [468]:
pop.unstack(level=1)  ### level = -1 gives the same thing as it's the last level

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [478]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [519]:
pop_flat = pop.reset_index(name='Population')
pop_flat

      level_0  level_1  Population
0  California     2000    33871648
1  California     2010    37253956
2    New York     2000    18976457
3    New York     2010    19378102
4       Texas     2000    20851820
5       Texas     2010    25145561

In [520]:
pop_flat.rename(columns={"level_0": "State", "level_1": "Year"})

        State  Year  Population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [523]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  36.8  53.0  37.8  32.0  37.5
     2      32.0  36.5  39.0  35.1  20.0  36.4
2014 1      27.0  37.3  28.0  35.6  52.0  36.8
     2      38.0  35.6  32.0  37.1  25.0  37.4

In [526]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     33.5  36.65  46.0  36.45  26.0  36.95
2014     32.5  36.45  30.0  36.35  38.5  37.10

In [532]:
health_data.mean(level='year',axis=0)

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     33.5  36.65  46.0  36.45  26.0  36.95
2014     32.5  36.45  30.0  36.35  38.5  37.10

In [527]:
data_mean2 = health_data.mean(level='visit')
data_mean2

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR   Temp
visit
1        31.0  37.05  40.5  36.7  42.0  37.15
2        35.0  36.05  35.5  36.1  22.5  36.90

In [529]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  35.166667  36.683333
2014  33.666667  36.633333

#### important

In [74]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [138]:
a1 = 'ABC'
b1 = np.arange(3)

In [139]:
[str(a)+str(b) for a,b in zip(a1,b1)]

['A0', 'B1', 'C2']

In [146]:
count = 0
out = np.empty(9,dtype='<U2')
for a in a1:
    for b in b1:
        out[count] = str(a)+str(b)
        count += 1
out.reshape((3,3),order='F')

array([['A0', 'B0', 'C0'],
       ['A1', 'B1', 'C1'],
       ['A2', 'B2', 'C2']], dtype='<U2')

In [147]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [148]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [149]:
x = [[1, 2],
     [3, 4]]

In [160]:
#np.concatenate((x, x), axis=1) works too
np.concatenate([x, x], axis=1) ## same as np.hstack((x,x))

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [151]:
#np.concatenate((x,x), axis=0) works too
np.concatenate([x, x], axis=0) ## same as np.vstack((x,x))

array([[1, 2],
       [3, 4],
       [1, 2],
       [3, 4]])

## `pd.concat()`is similar to `np.concatenate`

In [158]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2]) ## pd.concat((ser1, ser2)) works too

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [170]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [173]:
pd.concat([df1, df2],axis=1).fillna(0)

    A   B   A   B
1  A1  B1   0   0
2  A2  B2   0   0
3   0   0  A3  B3
4   0   0  A4  B4

In [176]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4')

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

In [178]:
pd.concat((df3,df4),axis=1) ## same pd.concat([df3, df4], axis='col')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [180]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
display('x', 'y')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
2  A2  B2
3  A3  B3

In [184]:
y.index = x.index

In [186]:
pd.concat([x, y]) ## works but

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [187]:
pd.concat([x, y], verify_integrity=True) ## to allow error msg

ValueError: Indexes have overlapping values: [0, 1]

In [188]:
## new index will be created despite overlap
pd.concat([x, y], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [189]:
pd.concat([x, y], keys=['x', 'y']) ## like those panel earlier

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [190]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6])') ## default outer join (Or)

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [191]:
display('df5', 'df6',
        "pd.concat([df5, df6], join='inner')")  ## Inner join (and)

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [192]:
display('df5', 'df6',
        "pd.concat([df5, df6], join_axes=[df5.columns])")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join_axes=[df5.columns])
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [193]:
display('df5', 'df6',
        "pd.concat([df5, df6], join_axes=[df5.columns])")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join_axes=[df5.columns])
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [194]:
display('df5', 'df6',
        "pd.concat([df5, df6], join_axes=[df6.columns])")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join_axes=[df6.columns])
    B   C    D
1  B1  C1  NaN
2  B2  C2  NaN
3  B3  C3   D3
4  B4  C4   D4

`df.append` is not very efficient. use `df.concat` instead

### Merge and join
#### above can be used too

In [195]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [201]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [202]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [210]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5,how='inner')",
        "pd.merge(df1, df5,how='outer')","pd.merge(df1, df5,on='group')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5,how='inner')
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

pd.merge(df1, df5,how='outer')
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

pd.merge(df1, df5,on='group')
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

Likely the inner == outer is due to second table not havingthe employee column

In [206]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')") ## like where in SQL

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [213]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [214]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [220]:
df3.rename(columns={'name':'employee'}) ## then join works too

  employee  salary
0      Bob   70000
1     Jake   80000
2     Lisa  120000
3      Sue   90000

In [225]:
## df3.index = np.arange(0,4)

In [227]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [232]:
## merge on an index (employee)
display('df1a', 'df2a',
        "pd.merge(df1a, df2a, left_index=True, right_index=True)")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [234]:
## the default of .join does the something, 
## pd.merge(df1a, df2a) by default merge on common column not index
display('df1a', 'df2a', 'df1a.join(df2a)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [235]:
display('df1a', 'df3', "pd.merge(df1a, df3, left_index=True, right_on='name')")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1a, df3, left_index=True, right_on='name')
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [237]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6, df7)','pd.merge(df6, df7,how="outer")')
## default is inner join

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7)
   name   food drink
0  Mary  bread  wine

pd.merge(df6, df7,how="outer")
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [242]:
display('df6', 'df7', "pd.merge(df6, df7, how='left')",
        "pd.merge(df6, df7, how='right')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='left')
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

pd.merge(df6, df7, how='right')
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [245]:
#conflicting name
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
display('df8', 'df9', 'pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [247]:
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0   362k      0 --:--:-- --:--:-- --:--:--  362k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   4113      0 --:--:-- --:--:-- --:--:--  4113
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   3103      0 --:--:-- --:--:-- --:--:--  3103

In [248]:
pop = pd.read_csv('../data/state-population.csv')
areas = pd.read_csv('../data/state-areas.csv')
abbrevs = pd.read_csv('../data/state-abbrevs.csv')

In [249]:
display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [260]:
pop.shape,areas.shape,abbrevs.shape

((2544, 4), (52, 2), (51, 2))

In [314]:
merged = pd.merge(pop,abbrevs,how='outer',left_on='state/region',right_on = 'abbreviation')
merged = merged.drop('abbreviation',axis=1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [315]:
merged.shape

(2544, 5)

In [268]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [269]:
np.any(merged.isnull(),axis=0) ## same stuff

array([False, False, False,  True,  True])

In [275]:
merged[np.isnan(merged['population'])].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [281]:
merged.loc[np.isnan(merged['population']),:].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [307]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [308]:
pd.Index(np.unique(pop['state/region'])) ^ np.unique(abbrevs['abbreviation'])
## same

Index(['PR', 'USA'], dtype='object')

In [309]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [379]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [380]:
final.isnull().any(axis=0)

state/region     False
ages             False
year             False
population        True
state             True
area (sq. mi)     True
dtype: bool

In [381]:
final[final['area (sq. mi)'].isnull()]['state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [382]:
final.shape

(2544, 6)

In [353]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [354]:
final.shape

(2448, 6)

In [393]:
### high performance query to be introduced later
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [394]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']
data2010.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

In [395]:
data2010.shape

(53, 5)

In [399]:
density[np.argsort(-density)].head()

state
District of Columbia    8898.897059
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
Massachusetts            621.815538
dtype: float64

In [387]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
Massachusetts            621.815538
dtype: float64

In [400]:
density[np.argsort(density)].head()

state
Alaska           1.087509
Wyoming          5.768079
Montana          6.736171
North Dakota     9.537565
South Dakota    10.583512
dtype: float64

In [391]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [402]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [403]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [406]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5),index=np.arange(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [407]:
ser.sum(),ser.mean()

(2.811925491708157, 0.5623850983416314)

In [408]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [410]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [411]:
df.sum()

A    2.389442
B    2.217101
dtype: float64

In [412]:
df.mean(axis=1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [416]:
planets.shape,planets.dropna().shape

((1035, 6), (498, 6))

In [417]:
planets.describe(percentiles=[0.025,0.5,0.975])

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
2.5%      1.000000        1.350555    0.012920     6.836750  1999.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
97.5%     6.000000     5022.500000   14.220000  1916.750000  2014.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [418]:
planets.dropna().describe(percentiles=[0.025,0.5,0.975])

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
2.5%     1.00000        3.119279    0.012770    6.270000  1999.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
97.5%    6.00000     4247.900000   13.851250  169.581250  2013.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

These are all methods of ``DataFrame`` and ``Series`` objects.

In [427]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [433]:
df.groupby('key')

In [428]:
df.groupby('key').mean()
#select mean(key) as mean_key from df
#group by key

     data
key
A     1.5
B     2.5
C     3.5

In [429]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [469]:
planets.groupby('method')['orbital_period'].describe(percentiles=[0.025,0.5,0.975])

,count,mean,std,min,2.5%,50%,97.5%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,265.601000,631.180000,996.759000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2109.700000,4343.500000,9344.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,5013.383750,27500.000000,616777.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,1846.750000,3300.000000,4875.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.245243,0.342887,1.484827,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,2.607836,66.541900,32882.321140,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,3.016325,360.200000,4228.400000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,1.076426,5.714932,180.773980,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,24.073075,57.011000,154.850550,160.000000

In [443]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [467]:
for (method, group) in planets.groupby('method'):
    print(f"{method}, shape = {group.shape}")

Astrometry, shape = (2, 6)
Eclipse Timing Variations, shape = (9, 6)
Imaging, shape = (38, 6)
Microlensing, shape = (23, 6)
Orbital Brightness Modulation, shape = (3, 6)
Pulsar Timing, shape = (5, 6)
Pulsation Timing Variations, shape = (1, 6)
Radial Velocity, shape = (553, 6)
Transit, shape = (397, 6)
Transit Timing Variations, shape = (4, 6)

In [450]:
temp_group = planets.groupby('method')
list(map(lambda x: [x[0],x[1].shape],temp_group))

[['Astrometry', (2, 6)],
 ['Eclipse Timing Variations', (9, 6)],
 ['Imaging', (38, 6)],
 ['Microlensing', (23, 6)],
 ['Orbital Brightness Modulation', (3, 6)],
 ['Pulsar Timing', (5, 6)],
 ['Pulsation Timing Variations', (1, 6)],
 ['Radial Velocity', (553, 6)],
 ['Transit', (397, 6)],
 ['Transit Timing Variations', (4, 6)]]

In [472]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [473]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [474]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [477]:
df.groupby('key').aggregate([min, np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [479]:
# dictionary style mapping
df.groupby('key').aggregate({'data1': 'min',
                             'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [480]:
def filter_func(x):
    return x['data2'].std() > 4

display('df', "df.groupby('key').std()", "df.groupby('key').filter(filter_func)")

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby('key').std()
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

df.groupby('key').filter(filter_func)
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [488]:
df.groupby('key').filter(filter_func).groupby('key').std()

       data1     data2
key
B    2.12132  4.949747
C    2.12132  4.242641

In [492]:
df.groupby('key').std()[df.groupby('key').std()['data2']>4]

       data1     data2
key
B    2.12132  4.949747
C    2.12132  4.242641

In [493]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [516]:
df.drop('key',axis=1).transform(lambda x: (x-x.mean())/x.std())

      data1     data2
0 -1.336306  0.155794
1 -0.801784 -1.402148
2 -0.267261 -0.467383
3  0.267261 -0.467383
4  0.801784  0.778971
5  1.336306  1.402148

In [517]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

display('df', "df.groupby('key').apply(norm_by_data2)")

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby('key').apply(norm_by_data2)
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [530]:
## works but not quite look like above, probably needs extra work
df.groupby('key').apply(lambda x:x['data1'] / x['data2'].sum())

key
A    0    0.000000
     3    0.375000
B    1    0.142857
     4    0.571429
C    2    0.166667
     5    0.416667
Name: data1, dtype: float64

In [531]:
## group by another index
L = [0, 1, 0, 1, 2, 0]
display('df', 'df.groupby(L).sum()')

df
  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

df.groupby(L).sum()
   data1  data2
0      7     17
1      4      3
2      4      7

In [532]:
### B and C together 
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
display('df2', 'df2.groupby(mapping).sum()')

df2
     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

df2.groupby(mapping).sum()
           data1  data2
consonant     12     19
vowel          3      8

In [536]:
##str.lower is applied to the key value
display('df2', 'df2.groupby(str.lower).mean()')

df2
     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

df2.groupby(str.lower).mean()
   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

In [550]:
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

In [562]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'

### important

In [551]:
## group by user defined variable
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [ ]:
decade